ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/SPGSS0_1.0.xml
        </group>
    <group id="SPGSS0_FUPDATE" name="SPGSS0_FUPDATE" instances="1" offset="0x204" instaddr="0x1FC" description="">
        <register id="SPGSS0_FUPDATE_U1_SCL_RX" width="32" offset="0x0" description="FUPDATE version of P0">
            <bitfield id="IOADDR" description="IO Address. This is the address that corresponds to the SOC address[27:2] of the module IP instance specific IO signal in the Full Write subregion of the pinmux subregion." begin="27" end="2" width="26" rwaccess="R/W">
            </bitfield>
            <bitfield id="LOCK" description="Sets lock bit" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOEFFECT" value="0x0" description="Writing this value has no effect"/>
                <bitenum id="LOCK" value="0x1" description="Set channel lock bit"/>
            </bitfield>
            <bitfield id="GSEL" description="GPIO channel Select 0: Select the P-Channel for the F update 1: Select the G-Channel for the F update" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="PCHAN" value="0x0" description="Select the P-Channel for the F update"/>
                <bitenum id="GCHAN" value="0x1" description="Select the G-Channel for the F update"/>
            </bitfield>
        </register>
        <register id="SPGSS0_FUPDATE_U1_SDA_TX" width="32" offset="0x4" description="FUPDATE version of P0">
            <bitfield id="IOADDR" description="IO Address. This is the address that corresponds to the SOC address[27:2] of the module IP instance specific IO signal in the Full Write subregion of the pinmux subregion." begin="27" end="2" width="26" rwaccess="R/W">
            </bitfield>
            <bitfield id="LOCK" description="Sets lock bit" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOEFFECT" value="0x0" description="Writing this value has no effect"/>
                <bitenum id="LOCK" value="0x1" description="Set channel lock bit"/>
            </bitfield>
            <bitfield id="GSEL" description="GPIO channel Select 0: Select the P-Channel for the F update 1: Select the G-Channel for the F update" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="PCHAN" value="0x0" description="Select the P-Channel for the F update"/>
                <bitenum id="GCHAN" value="0x1" description="Select the G-Channel for the F update"/>
            </bitfield>
        </register>
        <register id="SPGSS0_FUPDATE_U1_RTS" width="32" offset="0x8" description="FUPDATE version of P0">
            <bitfield id="IOADDR" description="IO Address. This is the address that corresponds to the SOC address[27:2] of the module IP instance specific IO signal in the Full Write subregion of the pinmux subregion." begin="27" end="2" width="26" rwaccess="R/W">
            </bitfield>
            <bitfield id="LOCK" description="Sets lock bit" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOEFFECT" value="0x0" description="Writing this value has no effect"/>
                <bitenum id="LOCK" value="0x1" description="Set channel lock bit"/>
            </bitfield>
            <bitfield id="GSEL" description="GPIO channel Select 0: Select the P-Channel for the F update 1: Select the G-Channel for the F update" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="PCHAN" value="0x0" description="Select the P-Channel for the F update"/>
                <bitenum id="GCHAN" value="0x1" description="Select the G-Channel for the F update"/>
            </bitfield>
        </register>
        <register id="SPGSS0_FUPDATE_U1_CTS" width="32" offset="0xC" description="FUPDATE version of P0">
            <bitfield id="IOADDR" description="IO Address. This is the address that corresponds to the SOC address[27:2] of the module IP instance specific IO signal in the Full Write subregion of the pinmux subregion." begin="27" end="2" width="26" rwaccess="R/W">
            </bitfield>
            <bitfield id="LOCK" description="Sets lock bit" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOEFFECT" value="0x0" description="Writing this value has no effect"/>
                <bitenum id="LOCK" value="0x1" description="Set channel lock bit"/>
            </bitfield>
            <bitfield id="GSEL" description="GPIO channel Select 0: Select the P-Channel for the F update 1: Select the G-Channel for the F update" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="PCHAN" value="0x0" description="Select the P-Channel for the F update"/>
                <bitenum id="GCHAN" value="0x1" description="Select the G-Channel for the F update"/>
            </bitfield>
        </register>
        <register id="SPGSS0_FUPDATE_U2_SCL_RX" width="32" offset="0x10" description="FUPDATE version of P0">
            <bitfield id="IOADDR" description="IO Address. This is the address that corresponds to the SOC address[27:2] of the module IP instance specific IO signal in the Full Write subregion of the pinmux subregion." begin="27" end="2" width="26" rwaccess="R/W">
            </bitfield>
            <bitfield id="LOCK" description="Sets lock bit" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOEFFECT" value="0x0" description="Writing this value has no effect"/>
                <bitenum id="LOCK" value="0x1" description="Set channel lock bit"/>
            </bitfield>
            <bitfield id="GSEL" description="GPIO channel Select 0: Select the P-Channel for the F update 1: Select the G-Channel for the F update" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="PCHAN" value="0x0" description="Select the P-Channel for the F update"/>
                <bitenum id="GCHAN" value="0x1" description="Select the G-Channel for the F update"/>
            </bitfield>
        </register>
        <register id="SPGSS0_FUPDATE_U2_SDA_TX" width="32" offset="0x14" description="FUPDATE version of P0">
            <bitfield id="IOADDR" description="IO Address. This is the address that corresponds to the SOC address[27:2] of the module IP instance specific IO signal in the Full Write subregion of the pinmux subregion." begin="27" end="2" width="26" rwaccess="R/W">
            </bitfield>
            <bitfield id="LOCK" description="Sets lock bit" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOEFFECT" value="0x0" description="Writing this value has no effect"/>
                <bitenum id="LOCK" value="0x1" description="Set channel lock bit"/>
            </bitfield>
            <bitfield id="GSEL" description="GPIO channel Select 0: Select the P-Channel for the F update 1: Select the G-Channel for the F update" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="PCHAN" value="0x0" description="Select the P-Channel for the F update"/>
                <bitenum id="GCHAN" value="0x1" description="Select the G-Channel for the F update"/>
            </bitfield>
        </register>
        <register id="SPGSS0_FUPDATE_U2_RTS" width="32" offset="0x18" description="FUPDATE version of P0">
            <bitfield id="IOADDR" description="IO Address. This is the address that corresponds to the SOC address[27:2] of the module IP instance specific IO signal in the Full Write subregion of the pinmux subregion." begin="27" end="2" width="26" rwaccess="R/W">
            </bitfield>
            <bitfield id="LOCK" description="Sets lock bit" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOEFFECT" value="0x0" description="Writing this value has no effect"/>
                <bitenum id="LOCK" value="0x1" description="Set channel lock bit"/>
            </bitfield>
            <bitfield id="GSEL" description="GPIO channel Select 0: Select the P-Channel for the F update 1: Select the G-Channel for the F update" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="PCHAN" value="0x0" description="Select the P-Channel for the F update"/>
                <bitenum id="GCHAN" value="0x1" description="Select the G-Channel for the F update"/>
            </bitfield>
        </register>
        <register id="SPGSS0_FUPDATE_U2_CTS" width="32" offset="0x1C" description="FUPDATE version of P0">
            <bitfield id="IOADDR" description="IO Address. This is the address that corresponds to the SOC address[27:2] of the module IP instance specific IO signal in the Full Write subregion of the pinmux subregion." begin="27" end="2" width="26" rwaccess="R/W">
            </bitfield>
            <bitfield id="LOCK" description="Sets lock bit" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOEFFECT" value="0x0" description="Writing this value has no effect"/>
                <bitenum id="LOCK" value="0x1" description="Set channel lock bit"/>
            </bitfield>
            <bitfield id="GSEL" description="GPIO channel Select 0: Select the P-Channel for the F update 1: Select the G-Channel for the F update" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="PCHAN" value="0x0" description="Select the P-Channel for the F update"/>
                <bitenum id="GCHAN" value="0x1" description="Select the G-Channel for the F update"/>
            </bitfield>
        </register>
