ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/SPGSS0_1.0.xml
    <register id="SPGSS0_UC1_I2CT_IPSPECIFIC_SR" width="32" offset="0x43108" description="Status Register">
        <bitfield id="RREQ" description="Receive Request" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="No outstanding receive data."/>
            <bitenum id="SET" value="0x1" description="Module has outstanding receive data and is using clock stretching to delay the Controller until the data has been read from the RXDATA FIFO (RX FIFO is full)."/>
        </bitfield>
        <bitfield id="TREQ" description="Transmit Request" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="No outstanding transmit request."/>
            <bitenum id="SET" value="0x1" description="I2C Target is addressed as a transmitter and is using clock stretching to delay the Controller until data has been written to the TXDATA FIFO (TX FIFO is empty)."/>
        </bitfield>
        <bitfield id="OAR2SEL" description="OAR2 Address Matched This bit gets reevaluated after every address comparison." begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="Either the OAR2 address is not matched or the match is in legacy mode."/>
            <bitenum id="SET" value="0x1" description="OAR2 address matched and ACKed by the Target."/>
        </bitfield>
        <bitfield id="QCMDST" description="Quick Command Status
Value Description:
0: The last transaction was a normal transaction or a transaction has not occurred.
1: The last transaction was a Quick Command transaction" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The last transaction was a normal transaction or a transaction has not occurred."/>
            <bitenum id="SET" value="0x1" description="The last transaction was a Quick Command transaction."/>
        </bitfield>
        <bitfield id="QCMDRW" description="Quick Command Read / Write 
This bit only has meaning when the QCMDST bit is set. 
Value Description:
0: Quick command was a write
1: Quick command was a read" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="Quick command was a write"/>
            <bitenum id="SET" value="0x1" description="Quick command was a read"/>
        </bitfield>
        <bitfield id="RXMODE" description="Target FSM is in Rx MODE" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="The Target State Machine is not in the RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT or ADDR_ACK state with the bus direction set to write."/>
            <bitenum id="SET" value="0x1" description="The Target State Machine is in the RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT or ADDR_ACK state with the bus direction set to write."/>
        </bitfield>
        <bitfield id="BUSBSY" description="I2C bus is busy" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="The I2C Bus is not busy"/>
            <bitenum id="SET" value="0x1" description="The I2C Bus is busy. This is cleared on a timeout."/>
        </bitfield>
        <bitfield id="TXMODE" description="FSM is in TX MODE" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="State Machine is not in TX_DATA, TX_WAIT, TX_ACK  or ADDR_ACK state with the bus direction set to read."/>
            <bitenum id="SET" value="0x1" description="State Machine is in TX_DATA, TX_WAIT, TX_ACK  or ADDR_ACK state with the bus direction set to read."/>
        </bitfield>
        <bitfield id="STALE_TXFIFO" description="Stale Tx FIFO" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="Tx FIFO is not stale"/>
            <bitenum id="SET" value="0x1" description="The TX FIFO is stale. This occurs when the TX FIFO was not emptied during the previous I2C transaction."/>
        </bitfield>
        <bitfield id="ADDRMATCH" description="Indicates the address for which Target address match happened" begin="25" end="16" width="10" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
            <bitenum id="MAXIMUM" value="0x3FF" description="Maximum Value"/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO Clear Status" begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO Clear Status" begin="10" end="10" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="RXFE" description="Receive FIFO Empty  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="11" end="11" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver is not empty."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the receive holding register is empty. If the FIFO is enabled (FEN is 1), the receive FIFO is empty."/>
        </bitfield>
        <bitfield id="RXFF" description="Receive FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="12" end="12" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver can receive data."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the receive holding register is full. If the FIFO is enabled (FEN is 1), the receive FIFO is full."/>
        </bitfield>
        <bitfield id="TXFE" description="Transmit FIFO Empty  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="13" end="13" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter has data to transmit."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the transmit holding register is empty. If the FIFO is enabled (FEN is 1), the transmit FIFO is empty."/>
        </bitfield>
        <bitfield id="TXFF" description="Transmit FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="14" end="14" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter is not full."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the transmit holding register is full. If the FIFO is enabled (FEN is 1), the transmit FIFO is full."/>
        </bitfield>
        <bitfield id="ACKOEN" description="Status of ACK Override Enable" begin="15" end="15" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="ACK override is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="ACK override was enabled in design"/>
        </bitfield>
    </register>
    <register id="SPGSS0_UC1_I2CT_IPSPECIFIC_IFLS" width="32" offset="0x4310C" description="Interrupt FIFO Level Select Register">
        <bitfield id="TXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="LVL_3_4" value="0x1" description="TX FIFO &lt;= 3/4 empty"/>
            <bitenum id="LVL_1_2" value="0x2" description="TX FIFO &lt;= 1/2 empty (default)"/>
            <bitenum id="LVL_1_4" value="0x3" description="TX FIFO &lt;= 1/4 empty"/>
            <bitenum id="LVL_NOT_FULL" value="0x4" description="Opposite of full"/>
            <bitenum id="LVL_EMPTY" value="0x5" description="TX FIFO is empty"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x6" description="TX FIFO &lt;= 1"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x7" description="TX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
        </bitfield>
        <bitfield id="RXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="LVL_1_4" value="0x1" description="RX FIFO &gt;= 1/4 full"/>
            <bitenum id="LVL_1_2" value="0x2" description="RX FIFO &gt;= 1/2 full (default)"/>
            <bitenum id="LVL_3_4" value="0x3" description="RX FIFO &gt;= 3/4 full"/>
            <bitenum id="LVL_NOT_EMPTY" value="0x4" description="Opposite of empty"/>
            <bitenum id="LVL_FULL" value="0x5" description="RX FIFO is full"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x6" description="RX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x7" description="RX_FIFO &lt;= 1"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO CLEAR. Setting this bit will clear the TX FIFO contents." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO CLEAR. Setting this bit will clear the RX FIFO contents." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
    </register>
    <register id="SPGSS0_UC1_I2CT_IPSPECIFIC_GFCTL" width="32" offset="0x43118" description="I2C Glitch Filter Control">
        <bitfield id="AGFEN" description="Analog Glitch Suppression Enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Analog Glitch Filter disable"/>
            <bitenum id="ENABLE" value="0x1" description="Analog Glitch Filter enable"/>
        </bitfield>
    </register>
