ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/SPGSS0_1.0.xml
        </group>
    <register id="SPGSS0_UC1_IPSPECIFIC_IPMODE" width="32" offset="0x83100" description="Mode Selection Register">
        <bitfield id="SELECT" description="Free run control" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="UART" value="0x0" description="Default functionality is UART"/>
            <bitenum id="SPI" value="0x1" description="SPG in SPI Mode"/>
            <bitenum id="I2C_CONTROLLER" value="0x2" description="SPG in I2C Controller Mode"/>
            <bitenum id="I2C_PERIPHERAL" value="0x3" description="SPG in I2C Peripheral Mode"/>
        </bitfield>
    </register>
    <group id="SPGSS0_EXT_GPRCM_UC2_GPRCM" name="SPGSS0_EXT_GPRCM_UC2_GPRCM" instances="1" offset="0x84800" instaddr="0x100" description="">
        <register id="SPGSS0_EXT_GPRCM_UC2_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="SPGSS0_EXT_GPRCM_UC2_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="SPGSS0_EXT_GPRCM_UC2_CLKCFG" width="32" offset="0x8" description="Peripheral Clock Configuration Register">
            <bitfield id="BLOCKASYNC" description="Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Not block async clock request"/>
                <bitenum id="ENABLE" value="0x1" description="Block async clock request"/>
            </bitfield>
        </register>
        <register id="SPGSS0_EXT_GPRCM_UC2_GPRCM_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
        </group>
    <register id="SPGSS0_UC2_IPSPECIFIC_IPMODE" width="32" offset="0x85100" description="Mode Selection Register">
        <bitfield id="SELECT" description="Free run control" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="UART" value="0x0" description="Default functionality is UART"/>
            <bitenum id="SPI" value="0x1" description="SPG in SPI Mode"/>
            <bitenum id="I2C_CONTROLLER" value="0x2" description="SPG in I2C Controller Mode"/>
            <bitenum id="I2C_PERIPHERAL" value="0x3" description="SPG in I2C Peripheral Mode"/>
        </bitfield>
    </register>
    <group id="SPGSS0_UNICOMM_LPBK" name="SPGSS0_UNICOMM_LPBK" instances="1" offset="0xA0120" instaddr="0x20" description="">
        <register id="SPGSS0_LPBK0" width="32" offset="0x0" description="Loopback between SPG instances
User has to ensure that the SPGs looped back have the same underlying IP instantiated; i.e. both UART, both SPI, both I2C, etc.,">
            <bitfield id="CONTROLLER" description="Select SPG controller for loopback. 
Signals invovled in loopback based on interface chosen
1. SPI : CS, SCLK, SDI, SDO 
2. I2C : SCL, SDA
3. UART : TX, RX" begin="11" end="8" width="4" rwaccess="R/W">
                <bitenum id="SPG1" value="0x0" description="SPG commander select for loopback."/>
                <bitenum id="SPG2" value="0x1" description="SPG commander select for loopback."/>
                <bitenum id="SPG3" value="0x2" description="SPG commander select for loopback."/>
                <bitenum id="SPG4" value="0x3" description="SPG commander select for loopback."/>
                <bitenum id="SPG5" value="0x4" description="SPG commander select for loopback."/>
                <bitenum id="SPG6" value="0x5" description="SPG commander select for loopback."/>
                <bitenum id="SPG7" value="0x6" description="SPG commander select for loopback."/>
                <bitenum id="SPG8" value="0x7" description="SPG commander select for loopback."/>
                <bitenum id="SPG9" value="0x8" description="SPG commander select for loopback."/>
                <bitenum id="SPG10" value="0x9" description="SPG commander select for loopback."/>
                <bitenum id="SPG11" value="0xA" description="SPG commander select for loopback."/>
                <bitenum id="SPG12" value="0xB" description="SPG commander select for loopback."/>
                <bitenum id="SPG13" value="0xC" description="SPG commander select for loopback."/>
                <bitenum id="SPG14" value="0xD" description="SPG commander select for loopback."/>
                <bitenum id="SPG15" value="0xE" description="SPG commander select for loopback."/>
                <bitenum id="SPG16" value="0xF" description="SPG commander select for loopback."/>
            </bitfield>
            <bitfield id="EN" description="Loopback  enable" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
                <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
            </bitfield>
            <bitfield id="PERIPHERAL" description="Select SPG peripheral for loopback. 
Signals invovled in loopback based on interface chosen
1. SPI : CS, SCLK, SDI, SDO 
2. I2C : SCL, SDA
3. UART : TX, RX" begin="15" end="12" width="4" rwaccess="R/W">
                <bitenum id="SPG1" value="0x0" description="SPG responder select for loopback."/>
                <bitenum id="SPG2" value="0x1" description="SPG responder select for loopback."/>
                <bitenum id="SPG3" value="0x2" description="SPG responder select for loopback."/>
                <bitenum id="SPG4" value="0x3" description="SPG responder select for loopback."/>
                <bitenum id="SPG5" value="0x4" description="SPG responder select for loopback."/>
                <bitenum id="SPG6" value="0x5" description="SPG responder select for loopback."/>
                <bitenum id="SPG7" value="0x6" description="SPG responder select for loopback."/>
                <bitenum id="SPG8" value="0x7" description="SPG responder select for loopback."/>
                <bitenum id="SPG9" value="0x8" description="SPG responder select for loopback."/>
                <bitenum id="SPG10" value="0x9" description="SPG responder select for loopback."/>
                <bitenum id="SPG11" value="0xA" description="SPG responder select for loopback."/>
                <bitenum id="SPG12" value="0xB" description="SPG responder select for loopback."/>
                <bitenum id="SPG13" value="0xC" description="SPG responder select for loopback."/>
                <bitenum id="SPG14" value="0xD" description="SPG responder select for loopback."/>
                <bitenum id="SPG15" value="0xE" description="SPG responder select for loopback."/>
                <bitenum id="SPG16" value="0xF" description="SPG responder select for loopback."/>
            </bitfield>
        </register>
